const List<Map<String, dynamic>> flagJsonData = [
  {
    "id": '১',
    "question": "প্রশ্ন : জাতীয় পতাকা কী?",
    "answer": "উঃ- জাতীয় পতাকা একটি দেশের স্বাধীনতা, ঐক্য ও সার্বভৌমত্বের প্রতীক।",
  },
  {
    "id": '২',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকার রং কী?",
    "answer": "উঃ- গাঢ় সবুজের মাঝখানে লাল বৃত্ত।",
  },
  {
    "id": '৩',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকার রূপকার কে?",
    "answer": "উঃ পটুয়া কামরুল হাসান",
  },
  {
    "id": '৪',
    "question": "প্রশ্ন : জাতীয় পতাকা কী অর্থ বহন করে ?",
    "answer":
        "উঃ জাতীয় পতাকার মাঝের লাল বৃত্তটি হলো স্বাধীনতার নতুন সূর্য । গাঢ় সবুজ অংশটি বাংলার সবুজ প্রকৃতি।",
  },
  {
    "id": '৫',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকার দৈর্ঘ্য ও প্রস্থের অনুপাত কত?",
    "answer": "উঃ ১০:৬ বা ৫:৩ ।",
  },
  {
    "id": '৬',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকা কত সালে সরকারিভাবে গৃহীত হয়?",
    "answer": "উঃ ১৯৭২ সালে ।",
  },
  {
    "id": '৭',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকা প্রথম কবে উত্তোলন করা হয়?",
    "answer": "উঃ ১৯৭১ সালের ২রা মার্চ।",
  },
  {
    "id": '৮',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকা দিবস কবে?",
    "answer": "উঃ ২রা মার্চ।",
  },
  {
    "id": '৯',
    "question": "প্রশ্ন : বাংলাদেশের বাইরে সর্বপ্রথম কোথায় জাতীয় পতাকা উত্তোলন করা হয়?",
    "answer": "উঃ কলকাতায় তৎকালীন পাকিস্তানের ডিপুটি হাইকমিশনার অফিসের সামনে",
  },
  {
    "id": '১০',
    "question": "প্রশ্ন : গাড়িতে ব্যবহারের জন্য পতাকার মাপ কি?",
    "answer": "উঃ ১০ ইঞ্চি x ৬ইঞ্চি",
  },
  {
    "id": '১১',
    "question": "প্রশ্ন : ভবনে ব্যবহৃত পতাকার মাপ কি?",
    "answer": "উঃ (১০ফুট x ৬ফুট) বা (৫ফুট x ৩ফুট) অথবা (২.৫ফুট x ১.৫ফুট)",
  },
];

const List<Map<String, dynamic>> introduceBDJsonData = [
  {
    "question": 'প্রশ্নঃ বাংলাদেশের সাংবিধানিক নাম কী? ',
    "answer": 'উঃ গণপ্রজাতন্ত্রী বাংলাদেশ।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের আয়তন কত?',
    "answer": 'উঃ ১,৪৭,৫৭০ বর্গ কিলোমিটার',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের রাজধানীর নাম কি?',
    "answer": 'উঃ ঢাকা',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রভাষা কী?',
    "answer": 'উঃ বাংলা',
  },
  {
    "question": 'প্রশ্নঃ ব্যবহারকারীর দিক থেকে বাংলা বিশ্বের কততম ভাষা?',
    "answer": 'উঃ ষষ্ঠ',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের মুদ্রার নাম কী?',
    "answer": 'উঃ টাকা',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের লোকসংখ্যা কত?',
    "answer": 'উঃ ১৭,৪২,৫৫,৮৯৪ জন',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের বিভাগ কয়টি ও কী কী?',
    "answer": 'উঃ ৮ টি -  ঢাকা, চট্টগ্রাম, রাজশাহী, খুলনা, বরিশাল, সিলেট , রংপুর এবং ময়মংসিংহ',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের চারপাশের সীমানার বর্ননা দাও?',
    "answer":
        'উঃ বাংলাদেশের উত্তরে ভারতের পশ্চিমবঙ্গ, আসাম ও মেঘালয়;\nপূর্বে ভারতের আসাম, ত্রিপুরা, মিজোরাম এবং মিয়ানমার;\nদক্ষিণে বঙ্গোপসাগর;\nপশ্চিমে ভারতের পশ্চিমবঙ্গ ও কুচবিহার রাজ্য অবস্থিত।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের জেলা কয়টি?',
    "answer": 'উঃ ৬৪টি',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের উপজেলা  কয়টি?',
    "answer": 'উঃ ৪৯৫ টি',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের গ্রাম  কয়টি?',
    "answer": 'উঃ ৮৭,১৯১ টি',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের সিটি কর্পোরেশন কয়টি?',
    "answer": 'উঃ ১২ টি।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের মোট সীমানা কত?',
    "answer": 'উঃ ৫,১৩৮ কিঃমি।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের মোট স্থলসীমা কত?',
    "answer": 'উঃ ৪,৪২৭ কিঃমি।',
  },
  {
    "question": 'প্রশ্নঃ ভারতের সাথে বাংলাদেশের সীমান্ত দৈর্ঘ্য কত?',
    "answer": 'উঃ ৪,১৪৪ কিঃমি।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের বেশিরভাগ মানুষ কী কাজ করেন?',
    "answer": 'উঃ  কৃষিকাজ।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রপ্রধান কে?',
    "answer": 'উঃ  রাষ্ট্রপতি।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের সরকার প্রধান কে?',
    "answer": 'উঃ  প্রধানমন্ত্রী।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রপতির সরকারি বাসভবনের নাম কি ?',
    "answer": 'উঃ  বঙ্গভবন।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের প্রধানমন্ত্রীর সরকারি বাসভবনের নাম কি ?',
    "answer": 'উঃ  গণভবন।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের প্রধান বিচারালয় কোনটি ?',
    "answer": 'উঃ  সুপ্রিম কোর্ট।',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রীয় অতিথি ভবন কয়টি ও কি কি?',
    "answer": 'উঃ  ৪ টি - ১)পদ্মা ২)মেঘনা ৩)যমুনা ৪)সুগন্ধা',
  },
  {
    "question": 'প্রশ্নঃ বাংলাদেশে কয়টি আন্তর্জাতিক বিমান বন্দর রয়েছে?',
    "answer":
        'উঃ  ৩ টি। \n ১)হজরত শাহজালাল আন্তর্জাতিক বিমানবন্দর - ঢাকা  \n২)ওসমানী আন্তর্জাতিক বিমানবন্দর - সিলেট \n৩)শাহ আমানত আন্তর্জাতিক বিমানবন্দর - চট্টগ্রাম',
  },
];

const List<Map<String, dynamic>> vasaAndulonJsonData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ আমাদের মাতৃভাষার নাম কি?",
    "answer": "উঃ- বাংলা",
  },
  {
    "id": '১',
    "question": "প্রশ্নঃ কত সালে ভাষা আন্দোলন হয়েছিল?",
    "answer": "উঃ- ১৯৫২ সালে।",
  },
  {
    "id": '২',
    "question":
        "প্রশ্নঃ ১৯৫২ সালে ভাষা আন্দোলনের শহিদদের স্মরণে কবে প্রথম শহিদমিনার নির্মাণ করা হয়?",
    "answer": "উঃ-  ২৩শে ফেব্রুয়ারি।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ শহিদ মিনারের স্থপতি কে?",
    "answer": "উঃ- হামিদুর রহমান ।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ বাংলাদেশের কেন্দ্রীয় শহিদমিনার কোথায় অবস্থিত?",
    "answer": "উঃ- ঢাকা মেডিকেল কলেজ হাসপাতালের পাশে।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ পাঁচজন ভাষা শহিদের নাম লেখো।",
    "answer": "উঃ- সালাম, রফিক, বরকত, জব্বার ও শফিউর।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ ভাষা আন্দোলনের শহিদদের স্মরণে রচিত বিখ্যাত গান কোনটি?",
    "answer": "উঃ- আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ 'আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি'— গানটির সুরকার কে?",
    "answer": "উঃ- আলতাফ মাহমুদ।",
  },
  {
    "id": '৮',
    "question":
        "প্রশ্নঃ উর্দু এবং উর্দুই হবে পাকিস্তানের একমাত্র রাষ্ট্রভাষা'— এ কথা কে, কবে এবং কোথায় ঘোষণা করেছিলেন?",
    "answer": "উঃ- মোহাম্মদ আলী জিন্নাহ, ১৯৪৮ সালের ২১শে মার্চ, ঢাকার রেসকোর্স ময়দানে ।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ কত সালে বাংলা ভাষা অন্যতম রাষ্ট্রভাষা হিসেবে স্বীকৃতি লাভ করে?",
    "answer": "উঃ- ১৯৫৬ সালে।",
  },
  {
    "id": '১০',
    "question":
        "প্রশ্নঃ ২১শে ফেব্রুয়ারিকে আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে ঘোষণা করে কোন প্রতিষ্ঠান?",
    "answer": "উঃ- ইউনেস্কো (১৯৯৯ সালের ১৭ই নভেম্বর)।",
  },
];

const List<Map<String, dynamic>> freedomJsonData = [
  {
    "id": '১০',
    "question":
        "প্রশ্নঃ ২১শে ফেব্রুয়ারিকে আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে ঘোষণা করে কোন প্রতিষ্ঠান?",
    "answer": "উঃ- ইউনেস্কো (১৯৯৯ সালের ১৭ই নভেম্বর)।",
  },
];
