const List<Map<String, dynamic>> flagJsonData = [
  {
    "id": '১',
    "question": "প্রশ্ন : জাতীয় পতাকা কী?",
    "answer": "উঃ- জাতীয় পতাকা একটি দেশের স্বাধীনতা, ঐক্য ও সার্বভৌমত্বের প্রতীক।",
  },
  {
    "id": '২',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকার রং কী?",
    "answer": "উঃ- গাঢ় সবুজের মাঝখানে লাল বৃত্ত।",
  },
  {
    "id": '৩',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকার রূপকার কে?",
    "answer": "উঃ পটুয়া কামরুল হাসান",
  },
  {
    "id": '৪',
    "question": "প্রশ্ন : জাতীয় পতাকা কী অর্থ বহন করে ?",
    "answer":
        "উঃ জাতীয় পতাকার মাঝের লাল বৃত্তটি হলো স্বাধীনতার নতুন সূর্য । গাঢ় সবুজ অংশটি বাংলার সবুজ প্রকৃতি।",
  },
  {
    "id": '৫',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকার দৈর্ঘ্য ও প্রস্থের অনুপাত কত?",
    "answer": "উঃ ১০:৬ বা ৫:৩ ।",
  },
  {
    "id": '৬',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকা কত সালে সরকারিভাবে গৃহীত হয়?",
    "answer": "উঃ ১৯৭২ সালে ।",
  },
  {
    "id": '৭',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকা প্রথম কবে উত্তোলন করা হয়?",
    "answer": "উঃ ১৯৭১ সালের ২রা মার্চ।",
  },
  {
    "id": '৮',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকা দিবস কবে?",
    "answer": "উঃ ২রা মার্চ।",
  },
  {
    "id": '৯',
    "question": "প্রশ্ন : বাংলাদেশের বাইরে সর্বপ্রথম কোথায় জাতীয় পতাকা উত্তোলন করা হয়?",
    "answer": "উঃ কলকাতায় তৎকালীন পাকিস্তানের ডিপুটি হাইকমিশনার অফিসের সামনে",
  },
  {
    "id": '১০',
    "question": "প্রশ্ন : গাড়িতে ব্যবহারের জন্য পতাকার মাপ কি?",
    "answer": "উঃ ১০ ইঞ্চি x ৬ইঞ্চি",
  },
  {
    "id": '১১',
    "question": "প্রশ্ন : ভবনে ব্যবহৃত পতাকার মাপ কি?",
    "answer": "উঃ (১০ফুট x ৬ফুট) বা (৫ফুট x ৩ফুট) অথবা (২.৫ফুট x ১.৫ফুট)",
  },
];
const List<Map<String, dynamic>> introduceBDJsonData = [
  {
    "id": "১",
    "question": 'প্রশ্নঃ বাংলাদেশের সাংবিধানিক নাম কী? ',
    "answer": 'উঃ গণপ্রজাতন্ত্রী বাংলাদেশ।',
  },
  {
    "id": "২",
    "question": 'প্রশ্নঃ বাংলাদেশের আয়তন কত?',
    "answer": 'উঃ ১,৪৭,৫৭০ বর্গ কিলোমিটার',
  },
  {
    "id": "৩",
    "question": 'প্রশ্নঃ বাংলাদেশের রাজধানীর নাম কি?',
    "answer": 'উঃ ঢাকা',
  },
  {
    "id": "৪",
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রভাষা কী?',
    "answer": 'উঃ বাংলা',
  },
  {
    "id": "৫",
    "question": 'প্রশ্নঃ ব্যবহারকারীর দিক থেকে বাংলা বিশ্বের কততম ভাষা?',
    "answer": 'উঃ ষষ্ঠ',
  },
  {
    "id": "৬",
    "question": 'প্রশ্নঃ বাংলাদেশের মুদ্রার নাম কী?',
    "answer": 'উঃ টাকা',
  },
  {
    "id": "৭",
    "question": 'প্রশ্নঃ বাংলাদেশের লোকসংখ্যা কত?',
    "answer": 'উঃ ১৭.১০ কোটি (অর্থনৈতিক সমীক্ষা - ২০২৪)',
  },
  {
    "id": "৮",
    "question": 'প্রশ্নঃ বাংলাদেশের বিভাগ কয়টি ও কী কী?',
    "answer": 'উঃ ৮ টি -  ঢাকা, চট্টগ্রাম, রাজশাহী, খুলনা, বরিশাল, সিলেট , রংপুর এবং ময়মংসিংহ',
  },
  {
    "id": "৯",
    "question": 'প্রশ্নঃ বাংলাদেশের চারপাশের সীমানার বর্ননা দাও?',
    "answer":
        'উঃ বাংলাদেশের উত্তরে ভারতের পশ্চিমবঙ্গ, আসাম ও মেঘালয়;\nপূর্বে ভারতের আসাম, ত্রিপুরা, মিজোরাম এবং মিয়ানমার;\nদক্ষিণে বঙ্গোপসাগর;\nপশ্চিমে ভারতের পশ্চিমবঙ্গ ও কুচবিহার রাজ্য অবস্থিত।',
  },
  {
    "id": "১০",
    "question": 'প্রশ্নঃ বাংলাদেশের জেলা কয়টি?',
    "answer": 'উঃ ৬৪টি',
  },
  {
    "id": "১১",
    "question": 'প্রশ্নঃ বাংলাদেশের উপজেলা  কয়টি?',
    "answer": 'উঃ ৪৯৫ টি',
  },
  {
    "id": "১২",
    "question": 'প্রশ্নঃ বাংলাদেশের গ্রাম  কয়টি?',
    "answer": 'উঃ ৮৭,১৯১ টি',
  },
  {
    "id": "১৩",
    "question": 'প্রশ্নঃ বাংলাদেশের সিটি কর্পোরেশন কয়টি?',
    "answer": 'উঃ ১২ টি।',
  },
  {
    "id": "১৪",
    "question": 'প্রশ্নঃ বাংলাদেশের মোট সীমানা কত?',
    "answer": 'উঃ ৫,১৩৮ কিঃমি।',
  },
  {
    "id": "১৫",
    "question": 'প্রশ্নঃ বাংলাদেশের মোট স্থলসীমা কত?',
    "answer": 'উঃ ৪,৪২৭ কিঃমি।',
  },
  {
    "id": "১৬",
    "question": 'প্রশ্নঃ ভারতের সাথে বাংলাদেশের সীমান্ত দৈর্ঘ্য কত?',
    "answer": 'উঃ ৪,১৪৪ কিঃমি।',
  },
  {
    "id": "১৭",
    "question": 'প্রশ্নঃ বাংলাদেশের বেশিরভাগ মানুষ কী কাজ করেন?',
    "answer": 'উঃ  কৃষিকাজ।',
  },
  {
    "id": "১৮",
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রপ্রধান কে?',
    "answer": 'উঃ  রাষ্ট্রপতি।',
  },
  {
    "id": "১৯",
    "question": 'প্রশ্নঃ বাংলাদেশের সরকার প্রধান কে?',
    "answer": 'উঃ  প্রধানমন্ত্রী।',
  },
  {
    "id": "২০",
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রপতির সরকারি বাসভবনের নাম কি ?',
    "answer": 'উঃ  বঙ্গভবন।',
  },
  {
    "id": "২১",
    "question": 'প্রশ্নঃ বাংলাদেশের প্রধানমন্ত্রীর সরকারি বাসভবনের নাম কি ?',
    "answer": 'উঃ  গণভবন।',
  },
  {
    "id": "২২",
    "question": 'প্রশ্নঃ বাংলাদেশের প্রধান বিচারালয় কোনটি ?',
    "answer": 'উঃ  সুপ্রিম কোর্ট।',
  },
  {
    "id": "২৩",
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রীয় অতিথি ভবন কয়টি ও কি কি?',
    "answer": 'উঃ  ৪ টি - ১)পদ্মা ২)মেঘনা ৩)যমুনা ৪)সুগন্ধা',
  },
  {
    "id": "২৪",
    "question": 'প্রশ্নঃ বাংলাদেশে কয়টি আন্তর্জাতিক বিমান বন্দর রয়েছে?',
    "answer":
        'উঃ  ৩ টি। \n ১)হজরত শাহজালাল আন্তর্জাতিক বিমানবন্দর - ঢাকা  \n২)ওসমানী আন্তর্জাতিক বিমানবন্দর - সিলেট \n৩)শাহ আমানত আন্তর্জাতিক বিমানবন্দর - চট্টগ্রাম',
  },
];
const List<Map<String, dynamic>> vasaAndulonJsonData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ আমাদের মাতৃভাষার নাম কি?",
    "answer": "উঃ- বাংলা",
  },
  {
    "id": '১',
    "question": "প্রশ্নঃ কত সালে ভাষা আন্দোলন হয়েছিল?",
    "answer": "উঃ- ১৯৫২ সালে।",
  },
  {
    "id": '২',
    "question":
        "প্রশ্নঃ ১৯৫২ সালে ভাষা আন্দোলনের শহিদদের স্মরণে কবে প্রথম শহিদমিনার নির্মাণ করা হয়?",
    "answer": "উঃ-  ২৩শে ফেব্রুয়ারি।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ শহিদ মিনারের স্থপতি কে?",
    "answer": "উঃ- হামিদুর রহমান ।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ বাংলাদেশের কেন্দ্রীয় শহিদমিনার কোথায় অবস্থিত?",
    "answer": "উঃ- ঢাকা মেডিকেল কলেজ হাসপাতালের পাশে।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ পাঁচজন ভাষা শহিদের নাম লেখো।",
    "answer": "উঃ- সালাম, রফিক, বরকত, জব্বার ও শফিউর।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ ভাষা আন্দোলনের শহিদদের স্মরণে রচিত বিখ্যাত গান কোনটি?",
    "answer": "উঃ- আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ 'আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি'— গানটির সুরকার কে?",
    "answer": "উঃ- আলতাফ মাহমুদ।",
  },
  {
    "id": '৮',
    "question":
        "প্রশ্নঃ উর্দু এবং উর্দুই হবে পাকিস্তানের একমাত্র রাষ্ট্রভাষা'— এ কথা কে, কবে এবং কোথায় ঘোষণা করেছিলেন?",
    "answer": "উঃ- মোহাম্মদ আলী জিন্নাহ, ১৯৪৮ সালের ২১শে মার্চ, ঢাকার রেসকোর্স ময়দানে ।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ কত সালে বাংলা ভাষা অন্যতম রাষ্ট্রভাষা হিসেবে স্বীকৃতি লাভ করে?",
    "answer": "উঃ- ১৯৫৬ সালে।",
  },
  {
    "id": '১০',
    "question":
        "প্রশ্নঃ ২১শে ফেব্রুয়ারিকে আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে ঘোষণা করে কোন প্রতিষ্ঠান?",
    "answer": "উঃ- ইউনেস্কো (১৯৯৯ সালের ১৭ই নভেম্বর)।",
  },
];
// Freedom Fighter
const List<Map<String, dynamic>> birSresthoJsonData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য কত জনকে বীরশ্রেষ্ঠ উপাধিতে ভূষিত করা হয়?",
    "answer": "উঃ- ৭ জনকে।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য বীর উত্তম উপাধি লাভ করেন কত জন?",
    "answer": "উঃ- ৬৮ জন।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃমুক্তিযুদ্ধ পরিচালনার জন্য বাংলাদেশকে কয়টি সেক্টরে ভাগ করা হয়?",
    "answer": "উঃ- ১১টি সেক্টরে।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য বীরত্বসূচক রাষ্ট্রীয় খেতাব কয়টি ও কী কী?",
    "answer": "উঃ- ৪টি। যথা- ক. বীরশ্রেষ্ঠ, খ. বীর উত্তম, গ. বীর বিক্রম ও ঘ. বীর প্রতীক।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য মোট কত জনকে রাষ্ট্রীয় খেতাব প্রদান করা হয়?",
    "answer": "উঃ- ৬৭৬ জনকে।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য বীর প্রতীক উপাধি লাভ করেন কত জন?",
    "answer": "উঃ- ৪২৬ জনকে।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য বীর বিক্রম উপাধি লাভ করেন কত জন?",
    "answer": "উঃ- ১৭৫ জন।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধের দুজন নারী বীর প্রতীকের নাম কী?",
    "answer": "উঃ- তারামন বিবি ও ক্যাপ্টেন সিতারা বেগম।",
  },
  {
    "id": '৮',
    "question": "প্রশ্নঃ তারামন বিবি কত নম্বর সেক্টরে যুদ্ধ করেন?",
    "answer": "উঃ- ১১ নম্বর সেক্টরে।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ সিতারা বেগম কত নম্বর সেক্টরে যুদ্ধ করেন?",
    "answer": "উঃ- ২ নম্বর সেক্টরে।",
  },
  {
    "id": '১০',
    "question": "প্রশ্নঃ সবীরশ্রেষ্ঠ হামিদুর রহমানের কবর পূর্বে কোথায় ছিল?",
    "answer": "উঃ- ভারতের আমবাসা গ্রামে।",
  },
  {
    "id": '১১',
    "question": "প্রশ্নঃ বীরশ্রেষ্ঠ মতিউর রহমানের কবর কোথায় ছিল?",
    "answer": "উঃ- করাচির মাশরুর বিমান ঘাঁটিতে।",
  },
  {
    "id": '১২',
    "question": "প্রশ্নঃ বীরশ্রেষ্ঠ মতিউর রহমানকে বাংলাদেশে এনে কোথায় সমাহিত করা হয়?",
    "answer": "উঃ- মিরপুর বুদ্ধিজীবী কবরস্থানে।",
  },
  {
    "id": '১৩',
    "question": "প্রশ্নঃ বীরশ্রেষ্ঠ হামিদুর রহমানকে বাংলাদেশে এনে কোথায় সমাহিত করা হয়?",
    "answer": "উঃ- মিরপুর বুদ্ধিজীবী কবরস্থানে।",
  },
  {
    "id": '১৪',
    "question": "প্রশ্নঃ ক্যাপ্টেন মহিউদ্দিন জাহাঙ্গীর কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- বরিশাল জেলায়।",
  },
  {
    "id": '১৫',
    "question": "প্রশ্নঃ কোন বীরশ্রেষ্ঠর মৃতদেহ উদ্ধার করা সম্ভব হয়নি?",
    "answer": "উঃ- বীরশ্রেষ্ঠ রুহুল আমিনের।",
  },
  {
    "id": '১৬',
    "question": "প্রশ্নঃ বীরশ্রেষ্ঠ মতিউর রহমান কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- নরসিংদী জেলায়।",
  },
  {
    "id": '১৭',
    "question": "প্রশ্নঃ ল্যান্স নায়েক মুন্সি আব্দুর রউফ কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- ফরিদপুর জেলায়।",
  },
  {
    "id": '১৮',
    "question": "প্রশ্নঃ সিপাহি মোস্তফা কামাল কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- ভোলা জেলায়।",
  },
  {
    "id": '১৯',
    "question": "প্রশ্নঃ সিপাহি হামিদুর রহমান কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- ঝিনাইদহ জেলায়।",
  },
  {
    "id": '২০',
    "question": "প্রশ্নঃ ইঞ্জিনরুম আর্টিফিশার মোহাম্মদ রুহুল আমিন কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- নোয়াখালী জেলায়।",
  },
  {
    "id": '২১',
    "question": "প্রশ্নঃ ল্যান্স নায়েক নূর মোহাম্মদ শেখ কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- নড়াইল জেলায়।",
  },
];
// Sheikh Mujib Rahman
const List<Map<String, dynamic>> mujibData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমান কবে জন্মগ্রহণ করেন?",
    "answer": "উঃ- ১৯২০ সালের ১৭ই মার্চ ।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমান কোথায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- গোপালগঞ্জ জেলার টুঙ্গিপাড়ায়।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমানের পিতার নাম কী?",
    "answer": "উঃ- শেখ লুৎফর রহমান।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমানের মাতার নাম কী?",
    "answer": "উঃ- সায়েরা খাতুন",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমান ঢাকা বিশ্ববিদ্যালয়ে কোন বিষয়ে পড়ালেখা করেন",
    "answer": "উঃ- আইন বিষয়ে।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ বঙ্গবন্ধু কৰে সপরিবারে শহিদ হন ?",
    "answer": "উঃ- ১৯৭৫ সালের ১৫ই আগস্ট।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ বঙ্গবন্ধুর দেওয়া ঐতিহাসিক ৭ই মার্চের ভাষণটি কত মিনিটের ছিল?",
    "answer": "উঃ- ১৮ মিনিট।",
  },
  {
    "id": '৮',
    "question": "প্রশ্নঃ সোনার বাংলা গড়ার স্বপ্ন কে দেখেছিলেন?",
    "answer": "উঃ- বঙ্গবন্ধু শেখ মুজিবুর রহমান।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ বাংলাদেশের স্বাধীনতা সংগ্রামের মহানায়ক কে?",
    "answer": "উঃ- বঙ্গবন্ধু শেখ মুজিবুর রহমান।",
  },
  {
    "id": '১০',
    "question": "প্রশ্নঃ বঙ্গবন্ধুর লেখা বইগুলোর নাম কি?",
    "answer":
        "উত্তরঃ- \n১) অসমাপ্ত আত্মজীবনী \n২) আমার দেখা নয়াচীন \n৩) কারাগারের রোজনামচা \n৪) আমার কিছু কথা",
  },
  {
    "id": '১১',
    "question": "প্রশ্নঃ আগরতলা ষড়যন্ত্র মামলার প্রধান আসামী কে ছিলেন?",
    "answer": "উঃ- বঙ্গবন্ধু শেখ মুজিবুর রহমান।",
  },
  {
    "id": '১২',
    "question": "প্রশ্নঃ আগরতলা ষড়যন্ত্র মামলার মোট আসামী কত জন ছিলেন?",
    "answer": "উঃ- ৩৫ জন।",
  },
  {
    "id": '১৩',
    "question":
        "প্রশ্নঃ আগরতলা ষড়যন্ত্র মামলা থেকে বঙ্গবন্ধু শেখ মুজিবুর রহমানকে মুক্তি দেওয়া হয় কবে?",
    "answer": "উঃ- ১৯৬৯ সালের ২২ ফেব্রুয়ারি।",
  },
  {
    "id": '১৪',
    "question": "প্রশ্নঃ শেখ মুজিবুর রহমানকে 'বঙ্গবন্ধু' উপাধি কে দেন?",
    "answer": "উঃ- তৎকালীন ডাকসুর ভিপি তোফায়েল আহমেদ।",
  },
  {
    "id": '১৫',
    "question": "প্রশ্নঃ কোথায় শেখ মুজিবুর রহমানকে 'বঙ্গবন্ধু উপাধি দেওয়া হয়?",
    "answer": "উঃ- রেসকোর্স ময়দানে (বর্তমান সোহরাওয়ার্দী উদ্যানে)।",
  },
  {
    "id": '১৬',
    "question": "প্রশ্নঃ শেখ মুজিবুর রহমানকে 'বঙ্গবন্ধু' উপাধিতে ভূষিত করা হয় কত সালে?",
    "answer": "উঃ- ১৯৬৯ সালের ২৩ ফেব্রুয়ারি।",
  },
  {
    "id": '১৭',
    "question": "প্রশ্নঃ কে শেখ মুজিবুর রহমানকে 'জাতির জনক' ঘোষণা করেন?",
    "answer": "উঃ- আ.স.ম. আব্দুর রব।",
  },
  {
    "id": '১৮',
    "question": "প্রশ্নঃ শেখ মুজিবুর রহমানকে 'জাতির জনক' ঘোষণা করা হয় কবে?",
    "answer": "উঃ- ৩ মার্চ ১৯৭১।",
  },
  {
    "id": '১৯',
    "question":
        "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমানকে 'জাতির পিতা' হিসেবে স্বীকৃতি প্রদান করা হয় কবে?",
    "answer": "উঃ- ২০১১ সালে সংবিধানের পঞ্চদশ সংশোধনীর মাধ্যমে।",
  },
  {
    "id": '২০',
    "question":
        "প্রশ্নঃ শেখ মুজিবুর রহমানকে 'রাজনীতির কবি' বা 'Poet of Politics' উপাধিতে ভূষিত করে কে?",
    "answer": "উঃ- যুক্তরাষ্ট্রের বিখ্যাত ম্যাগাজিন 'নিউজউইক' (Newsweek)।",
  },
  {
    "id": '২১',
    "question": "প্রশ্নঃ শেখ মুজিবুর রহমানকে 'জুলিও কুরি পুরস্কার' প্রদান করে কে?",
    "answer": "উঃ- বিশ্ব শান্তি পরিষদ।",
  },
  {
    "id": '২২',
    "question":
        "প্রশ্নঃ বিশ্ব শান্তি পরিষদ শেখ মুজিবুর রহমানকে 'জুলিও কুরি পুরস্কার' প্রদান করে কেন?",
    "answer": "উঃ- বিশ্ব শান্তি প্রতিষ্ঠায় বিশেষ অবদানের জন্য।",
  },
  {
    "id": '২৩',
    "question": "প্রশ্নঃ কে পূর্ব পাকিস্তানের নাম 'বাংলাদেশ' নামকরণ করেন?",
    "answer": "উঃ- বঙ্গবন্ধু শেখ মুজিবুর রহমান।",
  },
  {
    "id": '২৪',
    "question":
        "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমান কবে পূর্ব পাকিস্তানের নাম 'বাংলাদেশ' নামকরণ করেন?",
    "answer": "উঃ- ১৯৬৯ সালের ৫ ডিসেম্বর।",
  },
];
const List<Map<String, dynamic>> muktijuddhoJsonData = [
  {
    'id': '১',
    'question': 'dsfasdfasdf',
    'answer': 'adsfasdfgdfg',
  }
];
