const List<Map<String, dynamic>> flagJsonData = [
  {
    "id": '১',
    "question": "প্রশ্ন : জাতীয় পতাকা কী?",
    "answer": "উঃ- জাতীয় পতাকা একটি দেশের স্বাধীনতা, ঐক্য ও সার্বভৌমত্বের প্রতীক।",
  },
  {
    "id": '২',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকার রং কী?",
    "answer": "উঃ- গাঢ় সবুজের মাঝখানে লাল বৃত্ত।",
  },
  {
    "id": '৩',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকার রূপকার কে?",
    "answer": "উঃ পটুয়া কামরুল হাসান",
  },
  {
    "id": '৪',
    "question": "প্রশ্ন : জাতীয় পতাকা কী অর্থ বহন করে ?",
    "answer":
        "উঃ জাতীয় পতাকার মাঝের লাল বৃত্তটি হলো স্বাধীনতার নতুন সূর্য । গাঢ় সবুজ অংশটি বাংলার সবুজ প্রকৃতি।",
  },
  {
    "id": '৫',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকার দৈর্ঘ্য ও প্রস্থের অনুপাত কত?",
    "answer": "উঃ ১০:৬ বা ৫:৩ ।",
  },
  {
    "id": '৬',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকা কত সালে সরকারিভাবে গৃহীত হয়?",
    "answer": "উঃ ১৯৭২ সালে ।",
  },
  {
    "id": '৭',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকা প্রথম কবে উত্তোলন করা হয়?",
    "answer": "উঃ ১৯৭১ সালের ২রা মার্চ।",
  },
  {
    "id": '৮',
    "question": "প্রশ্ন : বাংলাদেশের জাতীয় পতাকা দিবস কবে?",
    "answer": "উঃ ২রা মার্চ।",
  },
  {
    "id": '৯',
    "question": "প্রশ্ন : বাংলাদেশের বাইরে সর্বপ্রথম কোথায় জাতীয় পতাকা উত্তোলন করা হয়?",
    "answer": "উঃ কলকাতায় তৎকালীন পাকিস্তানের ডিপুটি হাইকমিশনার অফিসের সামনে",
  },
  {
    "id": '১০',
    "question": "প্রশ্ন : গাড়িতে ব্যবহারের জন্য পতাকার মাপ কি?",
    "answer": "উঃ ১০ ইঞ্চি x ৬ইঞ্চি",
  },
  {
    "id": '১১',
    "question": "প্রশ্ন : ভবনে ব্যবহৃত পতাকার মাপ কি?",
    "answer": "উঃ (১০ফুট x ৬ফুট) বা (৫ফুট x ৩ফুট) অথবা (২.৫ফুট x ১.৫ফুট)",
  },
];
const List<Map<String, dynamic>> introduceBDJsonData = [
  {
    "id": "১",
    "question": 'প্রশ্নঃ বাংলাদেশের সাংবিধানিক নাম কী? ',
    "answer": 'উঃ গণপ্রজাতন্ত্রী বাংলাদেশ।',
  },
  {
    "id": "২",
    "question": 'প্রশ্নঃ বাংলাদেশের আয়তন কত?',
    "answer": 'উঃ ১,৪৭,৫৭০ বর্গ কিলোমিটার',
  },
  {
    "id": "৩",
    "question": 'প্রশ্নঃ বাংলাদেশের রাজধানীর নাম কি?',
    "answer": 'উঃ ঢাকা',
  },
  {
    "id": "৪",
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রভাষা কী?',
    "answer": 'উঃ বাংলা',
  },
  {
    "id": "৫",
    "question": 'প্রশ্নঃ ব্যবহারকারীর দিক থেকে বাংলা বিশ্বের কততম ভাষা?',
    "answer": 'উঃ ষষ্ঠ',
  },
  {
    "id": "৬",
    "question": 'প্রশ্নঃ বাংলাদেশের মুদ্রার নাম কী?',
    "answer": 'উঃ টাকা',
  },
  {
    "id": "৭",
    "question": 'প্রশ্নঃ বাংলাদেশের লোকসংখ্যা কত?',
    "answer": 'উঃ ১৭.১০ কোটি (অর্থনৈতিক সমীক্ষা - ২০২৪)',
  },
  {
    "id": "৮",
    "question": 'প্রশ্নঃ বাংলাদেশের বিভাগ কয়টি ও কী কী?',
    "answer": 'উঃ ৮ টি -  ঢাকা, চট্টগ্রাম, রাজশাহী, খুলনা, বরিশাল, সিলেট , রংপুর এবং ময়মংসিংহ',
  },
  {
    "id": "৯",
    "question": 'প্রশ্নঃ বাংলাদেশের চারপাশের সীমানার বর্ননা দাও?',
    "answer":
        'উঃ বাংলাদেশের উত্তরে ভারতের পশ্চিমবঙ্গ, আসাম ও মেঘালয়;\nপূর্বে ভারতের আসাম, ত্রিপুরা, মিজোরাম এবং মিয়ানমার;\nদক্ষিণে বঙ্গোপসাগর;\nপশ্চিমে ভারতের পশ্চিমবঙ্গ ও কুচবিহার রাজ্য অবস্থিত।',
  },
  {
    "id": "১০",
    "question": 'প্রশ্নঃ বাংলাদেশের জেলা কয়টি?',
    "answer": 'উঃ ৬৪টি',
  },
  {
    "id": "১১",
    "question": 'প্রশ্নঃ বাংলাদেশের উপজেলা  কয়টি?',
    "answer": 'উঃ ৪৯৫ টি',
  },
  {
    "id": "১২",
    "question": 'প্রশ্নঃ বাংলাদেশের গ্রাম  কয়টি?',
    "answer": 'উঃ ৮৭,১৯১ টি',
  },
  {
    "id": "১৩",
    "question": 'প্রশ্নঃ বাংলাদেশের সিটি কর্পোরেশন কয়টি?',
    "answer": 'উঃ ১২ টি।',
  },
  {
    "id": "১৪",
    "question": 'প্রশ্নঃ বাংলাদেশের মোট সীমানা কত?',
    "answer": 'উঃ ৫,১৩৮ কিঃমি।',
  },
  {
    "id": "১৫",
    "question": 'প্রশ্নঃ বাংলাদেশের মোট স্থলসীমা কত?',
    "answer": 'উঃ ৪,৪২৭ কিঃমি।',
  },
  {
    "id": "১৬",
    "question": 'প্রশ্নঃ ভারতের সাথে বাংলাদেশের সীমান্ত দৈর্ঘ্য কত?',
    "answer": 'উঃ ৪,১৪৪ কিঃমি।',
  },
  {
    "id": "১৭",
    "question": 'প্রশ্নঃ বাংলাদেশের বেশিরভাগ মানুষ কী কাজ করেন?',
    "answer": 'উঃ  কৃষিকাজ।',
  },
  {
    "id": "১৮",
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রপ্রধান কে?',
    "answer": 'উঃ  রাষ্ট্রপতি।',
  },
  {
    "id": "১৯",
    "question": 'প্রশ্নঃ বাংলাদেশের সরকার প্রধান কে?',
    "answer": 'উঃ  প্রধানমন্ত্রী।',
  },
  {
    "id": "২০",
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রপতির সরকারি বাসভবনের নাম কি ?',
    "answer": 'উঃ  বঙ্গভবন।',
  },
  {
    "id": "২১",
    "question": 'প্রশ্নঃ বাংলাদেশের প্রধানমন্ত্রীর সরকারি বাসভবনের নাম কি ?',
    "answer": 'উঃ  গণভবন।',
  },
  {
    "id": "২২",
    "question": 'প্রশ্নঃ বাংলাদেশের প্রধান বিচারালয় কোনটি ?',
    "answer": 'উঃ  সুপ্রিম কোর্ট।',
  },
  {
    "id": "২৩",
    "question": 'প্রশ্নঃ বাংলাদেশের রাষ্ট্রীয় অতিথি ভবন কয়টি ও কি কি?',
    "answer": 'উঃ  ৪ টি - ১)পদ্মা ২)মেঘনা ৩)যমুনা ৪)সুগন্ধা',
  },
  {
    "id": "২৪",
    "question": 'প্রশ্নঃ বাংলাদেশে কয়টি আন্তর্জাতিক বিমান বন্দর রয়েছে?',
    "answer":
        'উঃ  ৩ টি। \n ১)হজরত শাহজালাল আন্তর্জাতিক বিমানবন্দর - ঢাকা  \n২)ওসমানী আন্তর্জাতিক বিমানবন্দর - সিলেট \n৩)শাহ আমানত আন্তর্জাতিক বিমানবন্দর - চট্টগ্রাম',
  },
];
const List<Map<String, dynamic>> vasaAndulonJsonData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ আমাদের মাতৃভাষার নাম কি?",
    "answer": "উঃ- বাংলা",
  },
  {
    "id": '১',
    "question": "প্রশ্নঃ কত সালে ভাষা আন্দোলন হয়েছিল?",
    "answer": "উঃ- ১৯৫২ সালে।",
  },
  {
    "id": '২',
    "question":
        "প্রশ্নঃ ১৯৫২ সালে ভাষা আন্দোলনের শহিদদের স্মরণে কবে প্রথম শহিদমিনার নির্মাণ করা হয়?",
    "answer": "উঃ-  ২৩শে ফেব্রুয়ারি।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ শহিদ মিনারের স্থপতি কে?",
    "answer": "উঃ- হামিদুর রহমান ।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ বাংলাদেশের কেন্দ্রীয় শহিদমিনার কোথায় অবস্থিত?",
    "answer": "উঃ- ঢাকা মেডিকেল কলেজ হাসপাতালের পাশে।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ পাঁচজন ভাষা শহিদের নাম লেখো।",
    "answer": "উঃ- সালাম, রফিক, বরকত, জব্বার ও শফিউর।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ ভাষা আন্দোলনের শহিদদের স্মরণে রচিত বিখ্যাত গান কোনটি?",
    "answer": "উঃ- আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ 'আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি'— গানটির সুরকার কে?",
    "answer": "উঃ- আলতাফ মাহমুদ।",
  },
  {
    "id": '৮',
    "question":
        "প্রশ্নঃ উর্দু এবং উর্দুই হবে পাকিস্তানের একমাত্র রাষ্ট্রভাষা'— এ কথা কে, কবে এবং কোথায় ঘোষণা করেছিলেন?",
    "answer": "উঃ- মোহাম্মদ আলী জিন্নাহ, ১৯৪৮ সালের ২১শে মার্চ, ঢাকার রেসকোর্স ময়দানে ।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ কত সালে বাংলা ভাষা অন্যতম রাষ্ট্রভাষা হিসেবে স্বীকৃতি লাভ করে?",
    "answer": "উঃ- ১৯৫৬ সালে।",
  },
  {
    "id": '১০',
    "question":
        "প্রশ্নঃ ২১শে ফেব্রুয়ারিকে আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে ঘোষণা করে কোন প্রতিষ্ঠান?",
    "answer": "উঃ- ইউনেস্কো (১৯৯৯ সালের ১৭ই নভেম্বর)।",
  },
];
const List<Map<String, dynamic>> birSresthoJsonData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য কত জনকে বীরশ্রেষ্ঠ উপাধিতে ভূষিত করা হয়?",
    "answer": "উঃ- ৭ জনকে।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য বীর উত্তম উপাধি লাভ করেন কত জন?",
    "answer": "উঃ- ৬৮ জন।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃমুক্তিযুদ্ধ পরিচালনার জন্য বাংলাদেশকে কয়টি সেক্টরে ভাগ করা হয়?",
    "answer": "উঃ- ১১টি সেক্টরে।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য বীরত্বসূচক রাষ্ট্রীয় খেতাব কয়টি ও কী কী?",
    "answer": "উঃ- ৪টি। যথা- ক. বীরশ্রেষ্ঠ, খ. বীর উত্তম, গ. বীর বিক্রম ও ঘ. বীর প্রতীক।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য মোট কত জনকে রাষ্ট্রীয় খেতাব প্রদান করা হয়?",
    "answer": "উঃ- ৬৭৬ জনকে।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য বীর প্রতীক উপাধি লাভ করেন কত জন?",
    "answer": "উঃ- ৪২৬ জনকে।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধে অবদানের জন্য বীর বিক্রম উপাধি লাভ করেন কত জন?",
    "answer": "উঃ- ১৭৫ জন।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ স্বাধীনতা যুদ্ধের দুজন নারী বীর প্রতীকের নাম কী?",
    "answer": "উঃ- তারামন বিবি ও ক্যাপ্টেন সিতারা বেগম।",
  },
  {
    "id": '৮',
    "question": "প্রশ্নঃ তারামন বিবি কত নম্বর সেক্টরে যুদ্ধ করেন?",
    "answer": "উঃ- ১১ নম্বর সেক্টরে।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ সিতারা বেগম কত নম্বর সেক্টরে যুদ্ধ করেন?",
    "answer": "উঃ- ২ নম্বর সেক্টরে।",
  },
  {
    "id": '১০',
    "question": "প্রশ্নঃ সবীরশ্রেষ্ঠ হামিদুর রহমানের কবর পূর্বে কোথায় ছিল?",
    "answer": "উঃ- ভারতের আমবাসা গ্রামে।",
  },
  {
    "id": '১১',
    "question": "প্রশ্নঃ বীরশ্রেষ্ঠ মতিউর রহমানের কবর কোথায় ছিল?",
    "answer": "উঃ- করাচির মাশরুর বিমান ঘাঁটিতে।",
  },
  {
    "id": '১২',
    "question": "প্রশ্নঃ বীরশ্রেষ্ঠ মতিউর রহমানকে বাংলাদেশে এনে কোথায় সমাহিত করা হয়?",
    "answer": "উঃ- মিরপুর বুদ্ধিজীবী কবরস্থানে।",
  },
  {
    "id": '১৩',
    "question": "প্রশ্নঃ বীরশ্রেষ্ঠ হামিদুর রহমানকে বাংলাদেশে এনে কোথায় সমাহিত করা হয়?",
    "answer": "উঃ- মিরপুর বুদ্ধিজীবী কবরস্থানে।",
  },
  {
    "id": '১৪',
    "question": "প্রশ্নঃ ক্যাপ্টেন মহিউদ্দিন জাহাঙ্গীর কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- বরিশাল জেলায়।",
  },
  {
    "id": '১৫',
    "question": "প্রশ্নঃ কোন বীরশ্রেষ্ঠর মৃতদেহ উদ্ধার করা সম্ভব হয়নি?",
    "answer": "উঃ- বীরশ্রেষ্ঠ রুহুল আমিনের।",
  },
  {
    "id": '১৬',
    "question": "প্রশ্নঃ বীরশ্রেষ্ঠ মতিউর রহমান কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- নরসিংদী জেলায়।",
  },
  {
    "id": '১৭',
    "question": "প্রশ্নঃ ল্যান্স নায়েক মুন্সি আব্দুর রউফ কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- ফরিদপুর জেলায়।",
  },
  {
    "id": '১৮',
    "question": "প্রশ্নঃ সিপাহি মোস্তফা কামাল কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- ভোলা জেলায়।",
  },
  {
    "id": '১৯',
    "question": "প্রশ্নঃ সিপাহি হামিদুর রহমান কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- ঝিনাইদহ জেলায়।",
  },
  {
    "id": '২০',
    "question": "প্রশ্নঃ ইঞ্জিনরুম আর্টিফিশার মোহাম্মদ রুহুল আমিন কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- নোয়াখালী জেলায়।",
  },
  {
    "id": '২১',
    "question": "প্রশ্নঃ ল্যান্স নায়েক নূর মোহাম্মদ শেখ কোন জেলায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- নড়াইল জেলায়।",
  },
];
const List<Map<String, dynamic>> mujibData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমান কবে জন্মগ্রহণ করেন?",
    "answer": "উঃ- ১৯২০ সালের ১৭ই মার্চ ।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমান কোথায় জন্মগ্রহণ করেন?",
    "answer": "উঃ- গোপালগঞ্জ জেলার টুঙ্গিপাড়ায়।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমানের পিতার নাম কী?",
    "answer": "উঃ- শেখ লুৎফর রহমান।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমানের মাতার নাম কী?",
    "answer": "উঃ- সায়েরা খাতুন",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমান ঢাকা বিশ্ববিদ্যালয়ে কোন বিষয়ে পড়ালেখা করেন",
    "answer": "উঃ- আইন বিষয়ে।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ বঙ্গবন্ধু কৰে সপরিবারে শহিদ হন ?",
    "answer": "উঃ- ১৯৭৫ সালের ১৫ই আগস্ট।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ বঙ্গবন্ধুর দেওয়া ঐতিহাসিক ৭ই মার্চের ভাষণটি কত মিনিটের ছিল?",
    "answer": "উঃ- ১৮ মিনিট।",
  },
  {
    "id": '৮',
    "question": "প্রশ্নঃ সোনার বাংলা গড়ার স্বপ্ন কে দেখেছিলেন?",
    "answer": "উঃ- বঙ্গবন্ধু শেখ মুজিবুর রহমান।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ বাংলাদেশের স্বাধীনতা সংগ্রামের মহানায়ক কে?",
    "answer": "উঃ- বঙ্গবন্ধু শেখ মুজিবুর রহমান।",
  },
  {
    "id": '১০',
    "question": "প্রশ্নঃ বঙ্গবন্ধুর লেখা বইগুলোর নাম কি?",
    "answer":
        "উত্তরঃ- \n১) অসমাপ্ত আত্মজীবনী \n২) আমার দেখা নয়াচীন \n৩) কারাগারের রোজনামচা \n৪) আমার কিছু কথা",
  },
  {
    "id": '১১',
    "question": "প্রশ্নঃ আগরতলা ষড়যন্ত্র মামলার প্রধান আসামী কে ছিলেন?",
    "answer": "উঃ- বঙ্গবন্ধু শেখ মুজিবুর রহমান।",
  },
  {
    "id": '১২',
    "question": "প্রশ্নঃ আগরতলা ষড়যন্ত্র মামলার মোট আসামী কত জন ছিলেন?",
    "answer": "উঃ- ৩৫ জন।",
  },
  {
    "id": '১৩',
    "question":
        "প্রশ্নঃ আগরতলা ষড়যন্ত্র মামলা থেকে বঙ্গবন্ধু শেখ মুজিবুর রহমানকে মুক্তি দেওয়া হয় কবে?",
    "answer": "উঃ- ১৯৬৯ সালের ২২ ফেব্রুয়ারি।",
  },
  {
    "id": '১৪',
    "question": "প্রশ্নঃ শেখ মুজিবুর রহমানকে 'বঙ্গবন্ধু' উপাধি কে দেন?",
    "answer": "উঃ- তৎকালীন ডাকসুর ভিপি তোফায়েল আহমেদ।",
  },
  {
    "id": '১৫',
    "question": "প্রশ্নঃ কোথায় শেখ মুজিবুর রহমানকে 'বঙ্গবন্ধু উপাধি দেওয়া হয়?",
    "answer": "উঃ- রেসকোর্স ময়দানে (বর্তমান সোহরাওয়ার্দী উদ্যানে)।",
  },
  {
    "id": '১৬',
    "question": "প্রশ্নঃ শেখ মুজিবুর রহমানকে 'বঙ্গবন্ধু' উপাধিতে ভূষিত করা হয় কত সালে?",
    "answer": "উঃ- ১৯৬৯ সালের ২৩ ফেব্রুয়ারি।",
  },
  {
    "id": '১৭',
    "question": "প্রশ্নঃ কে শেখ মুজিবুর রহমানকে 'জাতির জনক' ঘোষণা করেন?",
    "answer": "উঃ- আ.স.ম. আব্দুর রব।",
  },
  {
    "id": '১৮',
    "question": "প্রশ্নঃ শেখ মুজিবুর রহমানকে 'জাতির জনক' ঘোষণা করা হয় কবে?",
    "answer": "উঃ- ৩ মার্চ ১৯৭১।",
  },
  {
    "id": '১৯',
    "question":
        "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমানকে 'জাতির পিতা' হিসেবে স্বীকৃতি প্রদান করা হয় কবে?",
    "answer": "উঃ- ২০১১ সালে সংবিধানের পঞ্চদশ সংশোধনীর মাধ্যমে।",
  },
  {
    "id": '২০',
    "question":
        "প্রশ্নঃ শেখ মুজিবুর রহমানকে 'রাজনীতির কবি' বা 'Poet of Politics' উপাধিতে ভূষিত করে কে?",
    "answer": "উঃ- যুক্তরাষ্ট্রের বিখ্যাত ম্যাগাজিন 'নিউজউইক' (Newsweek)।",
  },
  {
    "id": '২১',
    "question": "প্রশ্নঃ শেখ মুজিবুর রহমানকে 'জুলিও কুরি পুরস্কার' প্রদান করে কে?",
    "answer": "উঃ- বিশ্ব শান্তি পরিষদ।",
  },
  {
    "id": '২২',
    "question":
        "প্রশ্নঃ বিশ্ব শান্তি পরিষদ শেখ মুজিবুর রহমানকে 'জুলিও কুরি পুরস্কার' প্রদান করে কেন?",
    "answer": "উঃ- বিশ্ব শান্তি প্রতিষ্ঠায় বিশেষ অবদানের জন্য।",
  },
  {
    "id": '২৩',
    "question": "প্রশ্নঃ কে পূর্ব পাকিস্তানের নাম 'বাংলাদেশ' নামকরণ করেন?",
    "answer": "উঃ- বঙ্গবন্ধু শেখ মুজিবুর রহমান।",
  },
  {
    "id": '২৪',
    "question":
        "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমান কবে পূর্ব পাকিস্তানের নাম 'বাংলাদেশ' নামকরণ করেন?",
    "answer": "উঃ- ১৯৬৯ সালের ৫ ডিসেম্বর।",
  },
];
const List<Map<String, dynamic>> muktijuddhoJsonData = [
  {
    'id': '১',
    'question': 'প্রশ্নঃ বাংলাদেশের মুক্তিযুদ্ধ কত সালে সংঘটিত হয়েছিল?',
    'answer': 'উঃ- ১৯৭১ সালে ।',
  },
  {
    'id': '২',
    'question': 'প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমান কোথায় ৭ই মার্চের ভাষণ দেন?',
    'answer': 'উঃ-  ঢাকার রেসকোর্স ময়দানে (বর্তমানে সোহ্রাওয়ার্দী উদ্যান)। ',
  },
  {
    'id': '৩',
    'question': 'প্রশ্নঃ বাংলাদেশের প্রথম সরকার কোথায় গঠিত হয়েছিল? ',
    'answer': 'উঃ- মুজিবনগরে (মেহেরপুরের বৈদ্যনাথতলায় ভবেরপাড়া গ্রামে)।',
  },
  {
    'id': '৪',
    'question': 'প্রশ্নঃ বাংলাদেশের প্রথম সরকার কত তারিখে গঠিত হয়?',
    'answer': 'উঃ-  ১৯৭১ সালের ১০ই এপ্রিল।',
  },
  {
    'id': '৫',
    'question': 'প্রশ্নঃ কে, কখন বাংলাদেশের স্বাধীনতা ঘোষণা করেন?',
    'answer':
        'উঃ- বঙ্গবন্ধু শেখ মুজিবুর রহমান ১৯৭১ সালের ২৫শে মার্চ মধ্যরাতে অর্থাৎ ২৬শে মার্চ প্রথম প্রহরে বাংলাদেশের স্বাধীনতা ঘোষণা করেন।',
  },
  {
    'id': '৬',
    'question':
        'প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমানকে কবে গ্রেফতার করে পশ্চিম পাকিস্তানে নিয়ে যাওয়া হয়?',
    'answer': 'উঃ- ১৯৭১ সালের ২৫শে মার্চ মধ্যরাতের পর অর্থাৎ ২৬শে মার্চের প্রথম প্রহরে। ',
  },
  {
    'id': '৭',
    'question':
        'প্রশ্নঃ মুক্তিযুদ্ধ চলার সময়ে বঙ্গবন্ধু শেখ মুজিবুর রহমানকে কোথায় বন্দি করে হয়েছিল?',
    'answer': 'উঃ- পাকিস্তানের করাচি শহরের মিয়ানওয়ালি কারাগারে।',
  },
  {
    'id': '৮',
    'question':
        'প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবুর রহমানকে পাকিস্তানের কারাগার থেকে কবে মুক্তি দেওয়া হয়?',
    'answer': 'উঃ- ১৯৭২ সালের ৮ই জানুয়ারি।',
  },
  {
    'id': '৯',
    'question': 'প্রশ্নঃ কবে, কোথায় স্বাধীনতার ইশতেহার পাঠ করা হয়?',
    'answer': 'উঃ- ১৯৭১ সালের ৩রা মার্চ, পল্টন ময়দানে।',
  },
  {
    'id': '১০',
    'question': 'প্রশ্নঃ বাংলাদেশের মুক্তিযুদ্ধের মহানায়ক কে?',
    'answer': 'উঃ- বঙ্গবন্ধু শেখ মুজিবুর রহমান।',
  },
  {
    'id': '১১',
    'question': 'প্রশ্নঃ বাংলাদেশের মুক্তিযুদ্ধের প্রধান সেনাপতি কে ছিলেন?',
    'answer': 'উঃ- জেনারেল এম. এ. জি. ওসমানী',
  },
  {
    'id': '১২',
    'question': 'প্রশ্নঃ বাংলাদেশের মুক্তিযুদ্ধে কতজন শহিদ হন?',
    'answer': 'উঃ- প্রায় ৩০ লাখ।',
  },
  {
    'id': '১৩',
    'question': 'প্রশ্নঃ কত তারিখে বাংলাদেশ মুক্তিযুদ্ধে চূড়ান্ত বিজয় অর্জন করে?',
    'answer': 'উঃ- ১৯৭১ সালের ১৬ই ডিসেম্বর।',
  },
  {
    'id': '১৪',
    'question': 'প্রশ্নঃ বাংলাদেশের মুক্তিযুদ্ধ কত মাস?',
    'answer': 'উঃ- প্রায় ৯ মাস।',
  }
];
const List<Map<String, dynamic>> muktiKhetabData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ মুক্তিযুদ্ধে অবদানের জন্য কতজনকে বীরশ্রেষ্ঠ খেতাব বা উপাধি দেওয়া হয়েছে?",
    "answer": "উঃ- ৭ জনকে।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ বাংলাদেশের সাতজন বীরশ্রেষ্ঠর নাম কী?",
    "answer": "উঃ- বাংলাদেশের সাতজন বীরশ্রেষ্ঠর নামঃ\n"
        "১. মহিউদ্দিন জাহাঙ্গীর\n"
        "২. মোহাম্মদ হামিদুর রহমান\n"
        "৩. মোহাম্মদ মোস্তফা কামাল\n"
        "৪. মোহাম্মদ রুহুল আমিন\n"
        "৫. মতিউর রহমান\n"
        "৬. মুন্সী আবদুর রউফ\n"
        "৭. নূর মোহাম্মদ শেখ।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ মুক্তিযুদ্যে অবদানের জন্য কতজন বীর উত্তম খেতাব দাত করেন?",
    "answer": "উঃ- ৬৮ জন।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ মুক্তিযুদ্ধে অবদানের জন্য কতজন বীর বিক্রম খেতাব লাভ করেন?",
    "answer": "উঃ- ১৭৫ জন।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ মুক্তিযুদ্ধে অবদানের জন্য কতজন বীর প্রতীক খেতাব লাভ করেন?",
    "answer": "উঃ- ৪২৬ জন।",
  },
  {
    "id": '৬',
    "question":
        "প্রশ্নঃ বাংলাদেশের মুক্তিযুদ্ধে বীর প্রতীক খেতাবপ্রাপ্ত দুজন নারী মুক্তিযোদ্ধার নাম কী?",
    "answer": "উঃ- ডা. সিতারা বেগম ও তারামন বিবি।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ  বাংলাদেশের মুক্তিযুদ্ধে খেতাবপ্রাপ্ত বীর মুক্তিযোদ্ধার সংখ্যা কত? ",
    "answer": "উঃ- ৬৭৬ জন",
  },
];
const List<Map<String, dynamic>> poderPorichoyData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ বাংলাদেশের রাষ্ট্রপ্রধানকে কী বলা হয়?",
    "answer": "উঃ- রাষ্ট্রপতি।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ বাংলাদেশের সরকার প্রধানকে কী বলা হয়?",
    "answer": "উঃ- প্রধানমন্ত্রী।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ প্রধানমন্ত্রীর কার্যালয়ের প্রধানকে কী বলা হয়?",
    "answer": "উঃ- মুখ্যসচিব।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ মন্ত্রণালয়ের নির্বাহী প্রধানকে কী বলা হয়?",
    "answer": "উঃ- মন্ত্রী।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ বাংলাদেশের সুপ্রিম কোর্টের প্রধানকে কী বলা হয়?",
    "answer": "উঃ- প্রধান বিচারপতি।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ  বাংলাদেশের বিশ্ববিদ্যালয়সমূহের প্রধানকে কী বলা হয়?",
    "answer": "উঃ- চ্যান্সেলর।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ  বাংলাদেশ ব্যাংকের প্রধানকে কী বলা হয়?",
    "answer": "উঃ- চগভর্নর।",
  },
  {
    "id": '৮',
    "question": "প্রশ্নঃ বিভাগের প্রশাসনিক প্রধানকে কী বলা হয়?",
    "answer": "উঃ- বিভাগীয় কমিশনার।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ সিটি কর্পোরেশনের প্রধানকে কী বলা হয়?",
    "answer": "উঃ- মেয়র বা নগরপিতা।",
  },
  {
    "id": '১০',
    "question": "প্রশ্নঃ  জেলার প্রশাসনিক প্রধানকে কী বলা হয়?",
    "answer": "উঃ- জেলা প্রশাসক।",
  },
  {
    "id": '১১',
    "question": "প্রশ্নঃ উপজেলার প্রশাসনিক প্রধানকে কী বলা হয়?",
    "answer": "উঃ- উপজেলা নির্বাহী কর্মকর্তা।",
  },
  {
    "id": '১২',
    "question": "প্রশ্নঃ উপজেলার নির্বাচিত জনপ্রতিনিধিকে কী বলা হয়? ",
    "answer": "উঃ- উপজেলা চেয়ারম্যান।",
  },
  {
    "id": '১৩',
    "question": "প্রশ্নঃ পুলিশ বাহিনীর প্রধানকে কী বলা হয়?",
    "answer": "উঃ- ইন্সপেক্টর জেনারেল অব পুলিশ (আইজিপি)।",
  },
];
const List<Map<String, dynamic>> bisisthoBektittoData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ বাংলাদেশের রাষ্ট্রপ্রধানকে কী বলা হয়?",
    "answer": "উঃ- রাষ্ট্রপতি।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ বাংলাদেশের সরকার প্রধানকে কী বলা হয়?",
    "answer": "উঃ- প্রধানমন্ত্রী।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ প্রধানমন্ত্রীর কার্যালয়ের প্রধানকে কী বলা হয়?",
    "answer": "উঃ- মুখ্যসচিব।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ মন্ত্রণালয়ের নির্বাহী প্রধানকে কী বলা হয়?",
    "answer": "উঃ- মন্ত্রী।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ বাংলাদেশের সুপ্রিম কোর্টের প্রধানকে কী বলা হয়?",
    "answer": "উঃ- প্রধান বিচারপতি।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ  বাংলাদেশের বিশ্ববিদ্যালয়সমূহের প্রধানকে কী বলা হয়?",
    "answer": "উঃ- চ্যান্সেলর।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ  বাংলাদেশ ব্যাংকের প্রধানকে কী বলা হয়?",
    "answer": "উঃ- চগভর্নর।",
  },
  {
    "id": '৮',
    "question": "প্রশ্নঃ বিভাগের প্রশাসনিক প্রধানকে কী বলা হয়?",
    "answer": "উঃ- বিভাগীয় কমিশনার।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ সিটি কর্পোরেশনের প্রধানকে কী বলা হয়?",
    "answer": "উঃ- মেয়র বা নগরপিতা।",
  },
  {
    "id": '১০',
    "question": "প্রশ্নঃ  জেলার প্রশাসনিক প্রধানকে কী বলা হয়?",
    "answer": "উঃ- জেলা প্রশাসক।",
  },
  {
    "id": '১১',
    "question": "প্রশ্নঃ উপজেলার প্রশাসনিক প্রধানকে কী বলা হয়?",
    "answer": "উঃ- উপজেলা নির্বাহী কর্মকর্তা।",
  },
  {
    "id": '১২',
    "question": "প্রশ্নঃ উপজেলার নির্বাচিত জনপ্রতিনিধিকে কী বলা হয়? ",
    "answer": "উঃ- উপজেলা চেয়ারম্যান।",
  },
  {
    "id": '১৩',
    "question": "প্রশ্নঃ পুলিশ বাহিনীর প্রধানকে কী বলা হয়?",
    "answer": "উঃ- ইন্সপেক্টর জেনারেল অব পুলিশ (আইজিপি)।",
  },
];
// Zilla and Division
const List<Map<String, dynamic>> dhakaZilaData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ ঢাকা বিভাগের জেলা কয়টি ও কী কী?",
    "answer":
        "উঃ- ১৩টি। যথা- ঢাকা, গাজীপুর, টাঙ্গাইল, নরসিংদী, মুন্সীগঞ্জ, মানিকগঞ্জ, কিশোরগঞ্জ, ফরিদপুর, রাজবাড়ী, গোপালগঞ্জ, মাদারীপুর, শরীয়তপুর ও নারায়ণগঞ্জ।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ ঢাকা বিভাগের সবচেয়ে বড় জেলা কোনটি?",
    "answer": "উঃ- টাঙ্গাইল।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ ঢাকা বিভাগের সবচেয়ে ছোট জেলা কোনটি?",
    "answer": "উঃ- নারায়ণগঞ্জ।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ ঢাকা বিভাগের আয়তন কত?",
    "answer": "উঃ- ২০,৫৩৯ বর্গকিলোমিটার।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ ঢাকা বিভাগের তিনটি দর্শনীয় স্থান",
    "answer": "উঃ- ক. লালবাগ কেল্লা, খ. জাতীয় জাদুঘর ও গ. জাতীয় স্মৃতিসৌধ।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ ঢাকা বিভাগের আয়তন কত?",
    "answer": "উঃ- ২০,৫৩৯ বর্গকিলোমিটার।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ ঢাকা বিভাগের তিনটি দর্শনীয় স্থান",
    "answer": "উঃ- ক. লালবাগ কেল্লা, খ. জাতীয় জাদুঘর ও গ. জাতীয় স্মৃতিসৌধ।",
  },
];
const List<Map<String, dynamic>> chittagongData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ চট্টগ্রাম বিভাগের জেলা কয়টি ও কী কী?",
    "answer":
        "উঃ- ১১টি। যথা- চট্টগ্রাম, রাঙামাটি, বান্দরবান, খাগড়াছড়ি, কক্সবাজার, ফেনী, নোয়াখালী, লক্ষ্মীপুর, চাঁদপুর, কুমিল্লা ও ব্রাহ্মণবাড়িয়া।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ চট্টগ্রাম বিভাগের সবচেয়ে বড় জেলা কোনটি?",
    "answer": "উঃ- রাঙামাটি।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ চট্টগ্রাম বিভাগের সবচেয়ে ছোট জেলা কোনটি?",
    "answer": "উঃ- ফেনী।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ চট্টগ্রাম বিভাগের আয়তন কত?",
    "answer": "উঃ- ৩৩,৯০৪ বর্গকিলোমিটার।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ চট্টগ্রাম বিভাগের তিনটি দর্শনীয় স্থানের নাম লেখো।",
    "answer": "উঃ- ক). কক্সবাজার সমুদ্র সৈকত \nখ). প্রবাল দ্বীপ সেন্টমার্টিন \nগ). নীলগিরি",
  },
];
const List<Map<String, dynamic>> rajshahiData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ রাজশাহী বিভাগের জেলা কয়টি ও কী কী?",
    "answer":
        "উঃ- ৮টি। যথা- রাজশাহী, চাঁপাইনবাবগঞ্জ, নওগাঁ, নাটোর, বগুড়া, জয়পুরহাট, পাবনা ও সিরাজগঞ্জ।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ রাজশাহী বিভাগের সবচেয়ে বড় জেলা কোনটি?",
    "answer": "উঃ- নওগাঁ।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ রাজশাহী বিভাগের সবচেয়ে ছোট জেলা কোনটি?",
    "answer": "উঃ- জয়পুরহাট।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ রাজশাহী বিভাগের আয়তন কত?",
    "answer": "উঃ- ১৮,১৭৭ বর্গকিলোমিটার।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ রাজশাহী বিভাগের তিনটি দর্শীয় স্থান",
    "answer": "উঃ- ক ). মহাস্থানগড়\nখ ). বরেন্দ্র জাদুঘর \nগ ). পুঠিয়ার রাজবাড়ি।",
  },
];
const List<Map<String, dynamic>> khulnaData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ খুলনা বিভাগের জেলা কয়টি ও কী কী?",
    "answer":
        "উঃ- ১০টি। যথা- খুলনা, সাতক্ষীরা, বাগেরহাট, যশোর, ঝিনাইদহ, মাগুরা, কুষ্টিয়া, মেহেরপুর, নড়াইল ও চুয়াডাঙ্গা।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ খুলনা বিভাগের সবচেয়ে বড় জেলা। কোনটি?",
    "answer": "উঃ- খুলনা।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ খুলনা বিভাগের সবচেয়ে ছোট জেলা কোনটি?",
    "answer": "উঃ- মেহেরপুর।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ খুলনা বিভাগের আয়তন কত?",
    "answer": "উঃ- ২২,২৮৫ বর্গকিলোমিটার।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ খুলনা বিভাগের তিনটি দর্শনীয় স্থানের নাম লেখো।",
    "answer": "উত্তরঃ- \nক ). সুন্দরবন \nখ ). ষাটগম্বুজ মসজিদ \nগ ). শিলাইদহ রবীন্দ্র কুঠিবাড়ি।",
  },
];
const List<Map<String, dynamic>> borishalData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ বরিশাল বিভাগের জেলা কয়টি?",
    "answer": "উঃ- ৬টি। যথা- বরিশাল, ভোলা, পিরোজপুর, ঝালকাঠি, পটুয়াখালী ও বরগুনা।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ বরিশাল বিভাগের সবচেয়ে বড় জেলা কোনটি?",
    "answer": "উঃ- ভোলা।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ বরিশাল বিভাগের সবচেয়ে ছোট জেলা কোনটি?",
    "answer": "উঃ- ঝালকাঠি।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ বরিশাল বিভাগের আয়তন কত?",
    "answer": "উঃ- ১৩,২৯৭ বর্গকিলোমিটার।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ বরিশাল বিভাগের তিনটি দর্শনীয় স্থান",
    "answer": "উত্তরঃ- \nক. কুয়াকাটা সমুদ্র সৈকত \nখ. দুর্গাসাগর দিঘি  \nগ. অক্সফোর্ড মিশন চার্চ।",
  },
];
const List<Map<String, dynamic>> sylhetData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ সিলেট বিভাগের জেলা কয়টি ও কী কী?",
    "answer": "উঃ- ৪টি। যথা- সিলেট, মৌলভীবাজার, সুনামগঞ্জ ও হবিগঞ্জ।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ সিলেট বিভাগের সবচেয়ে বড় জেলা কোনটি?",
    "answer": "উঃ- সুনামগঞ্জ।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ সিলেট বিভাগের সবচেয়ে ছোট জেলা কোনটি?",
    "answer": "উঃ- হবিগঞ্জ।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ সিলেট বিভাগের আয়তন কত?",
    "answer": "উঃ- ১২,৫৯৬ বর্গকিলোমিটার।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ সিলেট বিভাগের তিনটি দর্শনীয় স্থান ",
    "answer": "উত্তরঃ- \nক. হজরত শাহজালাল (র.)-এর মাজার \nখ. জাফলংয়ের পাহাড় \nগ. হাকালুকি হাওর",
  },
];
const List<Map<String, dynamic>> rongpurData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ রংপুর বিভাগের জেলা কয়টি ও কী কী?",
    "answer":
        "উঃ- ৮টি। যথা- রংপুর, কুড়িগ্রাম, গাইবান্ধা, লালমনিরহাট, দিনাজপুর, ঠাকুরগাঁও, পঞ্চগড় ও নীলফামারী।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ রংপুর বিভাগের সবচেয়ে বড় জেলা কোনটি?",
    "answer": "উঃ- দিনাজপুর।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ রংপুর বিভাগের সবচেয়ে ছোট জেলা কোনটি?",
    "answer": "উঃ- লালমনিরহাট।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ রংপুর বিভাগের আয়তন কত?",
    "answer": "উঃ- ১৬,৩১৭ বর্গকিলোমিটার।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ রংপুর বিভাগের তিনটি দর্শনীয় স্থানের নাম লেখো।",
    "answer": "উত্তরঃ- \nক ). কান্তজির মন্দির \nখ ). রামসাগর \nগ ). তাজহাট জমিদার বাড়ি।",
  },
];
const List<Map<String, dynamic>> mymensingData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ ময়মনসিংহ বিভাগের জেলা কয়টি ও কী কী?",
    "answer": "উঃ- ৪টি। যথা- ময়মনসিংহ, শেরপুর, জামালপুর ও নেত্রকোণা।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ ময়মনসিংহ বিভাগের সবচেয়ে বড় জেলা কোনটি?",
    "answer": "উঃ- ময়মনসিংহ।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ ময়মনসিংহ বিভাগের সবচেয়ে ছোট জেলা কোনটি?",
    "answer": "উঃ- শেরপুর।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ ময়মনসিংহ বিভাগের আয়তন কত?",
    "answer": "উঃ- ১০,৬৬৮ বর্গকিলোমিটার।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ ময়মনসিংহ বিভাগের তিনটি দর্শনীয় স্থান",
    "answer":
        "উত্তরঃ- \nক ). শিল্পাচার্য জয়নুল আবেদিন সংগ্রহশালা \nখ ). গজনী অবকাশ কেন্দ্র \nগ ). চীনামাটির পাহাড়।",
  },
];
const List<Map<String, dynamic>> borderAreaData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে উত্তরের জেলার নাম কী?",
    "answer": "উঃ- পঞ্চগড়।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে দক্ষিণের জেলার নাম কী?",
    "answer": "উঃ- কক্সবাজার।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে পূর্বের জেলার নাম কী?",
    "answer": "উঃ- বান্দরবান।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে পশ্চিমের জেলার নাম কী?",
    "answer": "উঃ- চাঁপাইনবাবগঞ্জ।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে উত্তরের উপজেলার নাম কী?",
    "answer": "উঃ- তেঁতুলিয়া।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে দক্ষিণের উপজেলার নাম কী?",
    "answer": "উঃ- টেকনাফ।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে পূর্বের উপজেলার নাম কী",
    "answer": "উঃ- থানচি।",
  },
  {
    "id": '৮',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে পশ্চিমের উপজেলার নাম কী?",
    "answer": "উঃ- শিবগঞ্জ।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে উত্তরের স্থানের নাম কী?",
    "answer": "উঃ- বাংলাবান্ধা।",
  },
  {
    "id": '১০',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে দক্ষিণের স্থানের নাম কী?",
    "answer": "উঃ- ছেঁড়াদ্বীপ।",
  },
  {
    "id": '১১',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে পূর্বের স্থানের নাম কী?",
    "answer": "উঃ- আখাইনঠং।",
  },
  {
    "id": '১২',
    "question": "প্রশ্নঃ বাংলাদেশের সবচেয়ে পশ্চিমের স্থানের নাম কী?",
    "answer": "উঃ- মনাকশা",
  },
];
const List<Map<String, dynamic>> nationalDayData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ জাতীয় গ্রন্থ দিবস কবে?",
    "answer": "উঃ- ১লা জানুয়ারি।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ জাতীয় সমাজসেবা দিবস?",
    "answer": "উঃ- ২ জানুয়ারি।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ বঙ্গবন্ধু শেখ মুজিবের স্বদেশ প্রত্যাবর্তন দিবস?",
    "answer": "উঃ- ১০ জানুয়ারি।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ জাতীয় শিক্ষক দিবস?",
    "answer": "উঃ- ১৯ জানুয়ারি।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ ২৪ জানুয়ারি?",
    "answer": "উঃ- গণঅভ্যুত্থান দিবস।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ জাতীয় জনসংখ্যা দিবস?",
    "answer": "উঃ- ২ ফেব্রুয়ারি।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ বিশ্ব জনসংখ্যা দিবস?",
    "answer": "উঃ- ১১ জুলাই।",
  },
  {
    "id": '৮',
    "question": "প্রশ্নঃ জাতীয় গ্রন্থাগার দিবস কবে?",
    "answer": "উঃ- ৫ই ফেব্রুয়ারি।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ সুন্দরবন দিবস?",
    "answer": "উঃ- ১৪ ফেব্রুয়ারি।",
  },
  {
    "id": '১০',
    "question": "প্রশ্নঃ বাংলাদেশের শহিদ দিবস (আন্তর্জাতিক মাতৃভাষা দিবস) কবে?",
    "answer": "উঃ- ২১শে ফেব্রুয়ারি।",
  },
  {
    "id": '১১',
    "question": "প্রশ্নঃ পিলখানা হত্যা দিবস?",
    "answer": "উঃ- ২৫ ফেব্রুয়ারি।",
  },
  {
    "id": '১২',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় পতাকা দিবস কবে?",
    "answer": "উঃ- ২রা মার্চ।",
  },
  {
    "id": '১৩',
    "question": "প্রশ্নঃ ফারাক্কা লং মার্চ দিবস?",
    "answer": "উঃ- ১৬ মে।",
  },
  {
    "id": '১৪',
    "question": "প্রশ্নঃ ছয় দফা দিবস?",
    "answer": "উঃ- ৭ জুন।",
  },
  {
    "id": '১৫',
    "question": "প্রশ্নঃ পলাশি দিবস?",
    "answer": "উঃ- ২৩ জুন।",
  },
  {
    "id": '১৬',
    "question": "প্রশ্নঃ বাংলাদেশের স্বাধীনতা ও জাতীয় দিবস কবে?",
    "answer": "উঃ- ২৬শে মার্চ।",
  },
  {
    "id": '১৭',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় গণহত্যা দিবস কবে?",
    "answer": "উঃ- ২৫শে মার্চ।",
  },
  {
    "id": '১৮',
    "question": "প্রশ্নঃ জাতীয় তামাকমুক্ত দিবস?",
    "answer": "উঃ- ৩১ মে।",
  },
  {
    "id": '১৯',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় শোক দিবস কবে?",
    "answer": "উঃ- ১৫ই আগস্ট।",
  },
  {
    "id": '২০',
    "question": "প্রশ্নঃ মুজিবনগর দিবস কবে পালিত হয়?",
    "answer": "উঃ- ১৭ই এপ্রিল।",
  },
  {
    "id": '২১',
    "question": "প্রশ্নঃ জাতীয় শিশু দিবস কবে?",
    "answer": "উঃ- ১৭ই মার্চ।",
  },
  {
    "id": '২২',
    "question": "প্রশ্নঃ জাতীয় শিক্ষা দিবস কবে?",
    "answer": "উঃ- ১৭ই সেপ্টেম্বর।",
  },
  {
    "id": '২৩',
    "question": "প্রশ্নঃ জাতীয় কন্যা শিশু দিবস?",
    "answer": "উঃ- ৩০ সেপ্টেম্বর।",
  },
  {
    "id": '২৪',
    "question": "প্রশ্নঃ জাতীয় যুব দিবস?",
    "answer": "উঃ- ১ নভেম্বর।",
  },
  {
    "id": '২৫',
    "question": "প্রশ্নঃ জেলহত্যা দিবস?",
    "answer": "উঃ- ৩ নভেম্বর।",
  },
  {
    "id": '২৬',
    "question": "প্রশ্নঃ সংবিধান দিবস?",
    "answer": "উঃ- ৪ নভেম্বর।",
  },
  {
    "id": '২৭',
    "question": "প্রশ্নঃ বাংলাদেশের সশস্ত্র বাহিনী দিবস কবে?",
    "answer": "উঃ- ২১শে নভেম্বর।",
  },
  {
    "id": '২৮',
    "question": "প্রশ্নঃ জাতীয় আয়কর দিবস?",
    "answer": "উঃ- ৩০ নভেম্বর।",
  },
  {
    "id": '২৯',
    "question": "প্রশ্নঃ মুক্তিযোদ্ধা দিবস?",
    "answer": "উঃ- ১ ডিসেম্বর।",
  },
  {
    "id": '৩০',
    "question": "প্রশ্নঃ রোকেয়া দিবস?",
    "answer": "উঃ- ৯ ডিসেম্বর।",
  },
  {
    "id": '৩১',
    "question": "প্রশ্নঃ VAT/মূসক দিবস?",
    "answer": "উঃ- ১০ ডিসেম্বর।",
  },
  {
    "id": '৩২',
    "question": "প্রশ্নঃ বাংলাদেশের শহিদ বুদ্ধিজীবী দিবস কবে?",
    "answer": "উঃ- ১৪ই ডিসেম্বর।",
  },
  {
    "id": '৩৩',
    "question": "প্রশ্নঃ বাংলাদেশের বিজয় দিবস কবে?",
    "answer": "উঃ- ১৬ই ডিসেম্বর।",
  },
  {
    "id": '৩৪',
    "question": "প্রশ্নঃ জাতীয় কৃষি দিবস?",
    "answer": "উঃ- ১/পহেলা অগ্রহায়ণ (১৫ নভেম্বর)।",
  },
];
const List<Map<String, dynamic>> nationalSubjectData = [
  {
    "id": '১',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় প্রতীক কী?",
    "answer":
        "উঃ- উভয় পাশে ধানের শীষ বেষ্টিত পানিতে ভাসমান শাপলা এবং ওপরে পাটগাছের তিনটি পাতা। পাতার উভয় পাশে দুটি করে তারকা।",
  },
  {
    "id": '২',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় ফুলের নাম কী?",
    "answer": "উঃ- শাপলা।",
  },
  {
    "id": '৩',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় ফলের নাম কী?",
    "answer": "উঃ- কাঁঠাল।",
  },
  {
    "id": '৪',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় পাখির নাম কী?",
    "answer": "উঃ- দোয়েল।",
  },
  {
    "id": '৫',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় পশুর নাম কী?",
    "answer": "উঃ- রয়েল বেঙ্গল টাইগার।",
  },
  {
    "id": '৬',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় মাছের নাম কী?",
    "answer": "উঃ- ইলিশ।",
  },
  {
    "id": '৭',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় বন কী?",
    "answer": "উঃ- সুন্দরবন।",
  },
  {
    "id": '৮',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় কবি কে?",
    "answer": "উঃ- কাজী নজরুল ইসলাম।",
  },
  {
    "id": '৯',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় মসজিদের নাম কী?",
    "answer": "উঃ- বায়তুল মোকাররম মসজিদ।",
  },
  {
    "id": '১০',
    "question": "প্রশ্নঃ বাংলাদেশের জাতীয় খেলার নাম কী?",
    "answer": "উঃ- কাবাডি।",
  },
];
const List<Map<String, dynamic>> educationData = [
  {
    "question": "(১) প্রশ্নঃ বাংলাদেশের শিক্ষার হার কোন বিভাগে বেশি?",
    "answer": "উঃ- ঢাকা।",
  },
  {
    "question": "(২) প্রশ্নঃ বাংলাদেশে প্রথম নিরক্ষরতামুক্ত জেলার নাম কী?",
    "answer": "উঃ- মাগুরা।",
  },
  {
    "question": "(৩) প্রশ্নঃ বাংলাদেশের প্রথম নিরক্ষরতামুক্ত গ্রাম কোনটি?",
    "answer": "উঃ- কৃষ্টপুর গ্রাম (ঠাকুরগাঁও জেলা)।",
  },
  {
    "question": "(৪) প্রশ্নঃ বাংলাদেশের কত বছর বয়সে শিশুদের প্রাথমিক শিক্ষা শুরু হয়?",
    "answer": "উঃ- উত্তর: ৬ বছর বয়সে।",
  },
  {
    "question": "প্রশ্নঃ সারাদেশে বাধ্যতামূলক প্রাথমিক শিক্ষা চালু হয় কত সালে?",
    "answer": "উঃ- ১৯৯৩ সালে।",
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশে প্রাথমিক বিদ্যালয়ের সংখ্যা কত?",
    "answer": "উঃ- ১ লক্ষ ৩৪ হাজার ১৪৭টি।",
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশে সরকারি বিশ্ববিদ্যালয় কতটি?",
    "answer": "উঃ- ৫২টি।",
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশে বর্তমানে (২০২৩ সালে) শিক্ষার হার কত?",
    "answer": "উঃ- ৭৫.২। (সূত্র: অর্থনৈতিক সমীক্ষা-২০২২]",
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশে এই পর্যন্ত কতটি 'শিক্ষা কমিশন' গঠিত হয়েছে?",
    "answer": "উঃ- ৫টি।",
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশে প্রথম 'শিক্ষা কমিশন' গঠিত হয় কত সালে?",
    "answer": "উঃ- ১৯৭২ সালে।",
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশে প্রথম 'জাতীয় শিক্ষা কমিশন' এর অপর নাম কী?",
    "answer": "উঃ- কুদরত-ই-খুদা শিক্ষা কমিশন।",
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশে প্রথম 'শিক্ষা কমিশন' এর প্রধান/চেয়ারম্যান কে ছিলেন?",
    "answer": "উঃ- ড. কুদরত-ই-খুদা।",
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশে সর্বশেষ 'জাতীয় শিক্ষানীতি' প্রণয়ন করা হয় কত সালে?",
    "answer": "উঃ- ২০১০ সালে।",
  },
  {
    "question": "প্রশ্নঃ ঢাকা বিশ্ববিদ্যায় প্রতিষ্ঠার লক্ষ্যে কোন কমিশন গঠন করা হয়?",
    "answer": "উঃ- নাথান কমিশন",
  },
  {
    "question": "প্রশ্নঃ পূর্ব বঙ্গ তথা বাংলাদেশের প্রথম সরকারি বিশ্ববিদ্যালয়ের নাম কী?",
    "answer": "উঃ- ঢাকা বিশ্ববিদ্যালয়।",
  },
  {
    "question": "প্রশ্নঃ ঢাকা বিশ্ববিদ্যালয় প্রতিষ্ঠিত হয় কবে?",
    "answer": "উঃ- ১৯২১ সালের ১ জুলাই।",
  },
  {
    "question": "প্রশ্নঃ ঢাকা বিশ্ববিদ্যালয় প্রতিষ্ঠায় অগ্রণী ভূমিকা পালন করেন কে?",
    "answer": "উঃ- নওয়াব সলিমুল্লাহ।",
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশের প্রথম ক্যাডেট কলেজ কোনটি?",
    "answer": "উঃ- ফৌজদারহাট ক্যাডেট কলেজ।",
  },
  {
    "question": "প্রশ্ন: বাংলাদেশের শিক্ষাবোর্ড কয়টি ও কী কী?",
    "answer": "উঃ- ১১টি। যথা- \n"
        "১. মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ড, ঢাকা\n"
        "২. মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ড, কুমিল্লা\n"
        "৩. মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ড, রাজশাহী\n"
        "৪. মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ড, যশোর\n"
        "০৫ . মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ড, চট্টগ্রাম\n"
        "৬. মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ড, সিলেট\n"
        "৭. মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ড, বরিশাল\n"
        "৮. মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ড, দিনাজপুর\n"
        "৯. মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ড, ময়মনসিংহ\n"
        "১০. বাংলাদেশ মাদ্রাসা শিক্ষা বোর্ড, ঢাকা\n"
        "১১. কারিগরি শিক্ষা বোর্ড, ঢাকা\n"
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশের ক্যাডেট কলেজ কয়টি ও কী কী?",
    "answer": "উঃ- ১২টি। যথা-\n"
        "১. ফৌজদারহাট ক্যাডেট কলেজ, চট্টগ্রাম\n"
        "২. মির্জাপুর ক্যাডেট কলেজ, টাঙ্গাইল\n"
        "৩. ঝিনাইদহ ক্যাডেট কলেজ, ঝিনাইদহ\n"
        "৪. রাজশাহী ক্যাডেট কলেজ, রাজশাহী\n"
        "৫. সিলেট ক্যাডেট কলেজ, সিলেট\n"
        "৬. রংপুর ক্যাডেট কলেজ, রংপুর\n"
        "৭. বরিশাল ক্যাডেট কলেজ, বরিশাল\n"
        "৮. পাবনা ক্যাডেট কলেজ, পাবনা\n"
        "৯. ময়মনসিংহ গার্লস ক্যাডেট কলেজ, ময়মনসিংহ\n"
        "১০. কুমিল্লা ক্যাডেট কলেজ, কুমিল্লা\n"
        "১১ . ফেনী গার্লস ক্যাডেট কলেজ, ফেনী\n"
        "১২. জয়পুরহাট গার্লস ক্যাডেট কলেজ, জয়পুরহাট।\n"
  },
  {
    "question": "প্রশ্নঃ বাংলাদেশে মহিলা ক্যাডেট কলেজ কয়টি ও কী কী?",
    "answer": "উঃ- তিনটি। এগুলো হলো-\n"
        "১. ময়মনসিংহ গার্লস ক্যাডেট কলেজ\n"
        "২. জয়পুরহাট গার্লস ক্যাডেট কলেজ\n"
        "৩. ফেনী গার্লস ক্যাডেট কলেজ\n"
  },
];
